2.2.013/src/Catalogs/МК_ВидыДокументов/МК_ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ВидыДокументов</name>
  <comment>Справочник видов электронных документов (связь со справочником МК)</comment>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПечатнойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВМояКоманда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПодписания</name>
    <type>
      <types>EnumRef.МК_МаршрутыПодписания</types>
    </type>
  </attributes>
  <attributes>
    <name>КодМинтруда</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Списочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ВидыДокументовМояКоманда/МК_ВидыДокументовМояКоманда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ВидыДокументовМояКоманда</name>
  <comment>Копия справочника из облака</comment>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМинтруда</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Опубликован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Catalogs/МК_ВидыДокументов/ManagerModule.bsl
&НаСервере
Функция ЭтоДокументКЭДО(мТипДок,мИдент) Экспорт
	мРез = Ложь;
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	МК_ВД.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.МК_ВидыДокументов КАК МК_ВД
	  	           |ГДЕ
		           |	МК_ВД.ТипОбъектаМетаданных = &ТипДокумента
				   |    И МК_ВД.ИдентификаторПечатнойФормы = &Идентификатор";
				   ;
		
	мЗапрос.УстановитьПараметр("ТипДокумента",мТипДок);
	мЗапрос.УстановитьПараметр("Идентификатор",мИдент);
		
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();    
	Если Выборка.Следующий() Тогда
		мРез = Истина;
	КонецЕсли;
	
	Возврат мРез;	
КонецФункции	


Функция МК_РеквВидаДокумента(мТипДок,мИдент) Экспорт  // Возвращает соответствие {МК_Код, МаршрутПодписания, КодМинтруда, Списочная?}
	мРез = Неопределено;
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1	               
				   |    МК_ВД.КодВМояКоманда КАК МК_Код,
				   |    МК_ВД.МаршрутПодписания КАК Маршрут,
				   |    МК_ВД.КодМинтруда КАК КодМинтруда,
				   |    МК_ВД.Списочный КАК Списочный
				   //|    МК_ВД.Ссылка КАК МК_Ссылка
	               |ИЗ
	               |	Справочник.МК_ВидыДокументов КАК МК_ВД
	  	           |ГДЕ
		           |	МК_ВД.ТипОбъектаМетаданных = &ТипДокумента
				   |    И МК_ВД.ИдентификаторПечатнойФормы = &Идентификатор";
				   ;
		
	мЗапрос.УстановитьПараметр("ТипДокумента",мТипДок);
	мЗапрос.УстановитьПараметр("Идентификатор",мИдент);
		
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();    
	Если Выборка.Следующий() Тогда
		мРез = Новый Соответствие;
		мРез.Вставить("МК_Код",Выборка.МК_Код);
		мРез.Вставить("Маршрут",Выборка.Маршрут);
		мРез.Вставить("КодМинтруда",Выборка.КодМинтруда);
		мРез.Вставить("Списочный",Выборка.Списочный);
		//мРез.Вставить("МК_Ссылка",Выборка.МК_Ссылка);
	КонецЕсли;
	
	Возврат мРез;	
КонецФункции	

Функция ЗаполнитьСправочник(мСправ) Экспорт    
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();
	Для Каждого мЭлемент Из мСправ Цикл     
		// Искать элементы справочника нужно по двум полям: ТипОбъектаМетаданных и ИдентификаторПечатнойФормы. Это - уникальный набор. Должен быть только один.		
		мЗапрос = Новый Запрос;
		мЗапрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	       	       |	МК_ВД.Ссылка КАК Ссылка
	       	       |ИЗ
	      	       |	Справочник.МК_ВидыДокументов КАК МК_ВД
	  	  	       |ГДЕ
		  	       |	МК_ВД.ТипОбъектаМетаданных = &ТипДокумента
				   |    И МК_ВД.ИдентификаторПечатнойФормы = &Идентификатор";
				   ;
		
		мЗапрос.УстановитьПараметр("ТипДокумента",мЭлемент.Type_Object);
		мЗапрос.УстановитьПараметр("Идентификатор",мЭлемент.Form_ID);
		
		РезультатЗапроса = мЗапрос.ВыполнитьПакет();
		Выборка = РезультатЗапроса[0].Выбрать();    
		Если Выборка.Следующий() Тогда
			мДок = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			мДок = Справочники.МК_ВидыДокументов.СоздатьЭлемент();  
			мДок.ТипОбъектаМетаданных = мЭлемент.Type_Object;
			мДок.ИдентификаторПечатнойФормы = мЭлемент.Form_ID;                  
			// Код минтруда будем проставлять только при добавлениию Его пользователь может поменять.
			мДок.КодМинтруда = Справочники.МК_ВидыДокументовМояКоманда.НайтиПоРеквизиту("ID",Строка(мЭлемент.type)).КодМинтруда;
		КонецЕсли;
    	мДок.Наименование = мЭлемент.name;
		мДок.КодВМояКоманда = мЭлемент.type;
		мДок.МаршрутПодписания = ОО.МК_ТипМаршрута(мЭлемент.route,2);
	    мДок.Базовый = Истина;		
		мДок.Записать();
	КонецЦикла;	
КонецФункции	            

Функция ОбновитьФормы1СНаСервере()  Экспорт
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
	мСеанс = ОО.СоздатьСеансСвязи(Истина); 
	мСправ = Новый Массив;	
	Если мСеанс = Неопределено Тогда
		// Ошибка авторизации. Ничего не делаем.
	Иначе   
		// Теперь второй справочник - Стыковка документов 1С и МояКоманда
		hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/document-types-1c-list", мСеанс); 
		hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");
		hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("GET", hЗапрос);  
		ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
			СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
			Если ТипЗнч(СтрОтвет) <> Тип("Структура")ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
				// Тут какая-то беда. Или структура не получена, или она неправильная  
			Иначе     
				мСправ = СтрОтвет.Data.Items;	
			КонецЕсли;	
		Исключение   
			мОшибка = "Ошибка получения справочника. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;
		КонецПопытки;       
		Если мСправ.Количество() >0 Тогда   
			мРезультат = ЗаполнитьСправочник(мСправ);
		КонецЕсли;		
	КонецЕсли;
КонецФункции
